emacs/.doom.d/config.org
#+TITLE: Doom Emacs Configuration

* Initialization
** User
#+BEGIN_SRC emacs-lisp
(setq user-full-name "maxminoS")
#+END_SRC

** System
#+BEGIN_SRC emacs-lisp
;; Open new frames in current Emacs
(require 'server)
(if (not (server-running-p)) (server-start))

;; Reload file if edited
(global-auto-revert-mode t)

;; Enable narrowing
(put 'narrow-to-region 'disabled nil)

;; Set frame transparency (needs compositor)
(set-frame-parameter (selected-frame) 'alpha '(95 . 95))
(add-to-list 'default-frame-alist '(alpha . (95 . 95)))
(set-frame-parameter (selected-frame) 'fullscreen 'maximized)
(add-to-list 'default-frame-alist '(fullscreen . maximized))
(setq frame-resize-pixelwise t)

;; Set appropriate macOS key modifiers
(setq mac-command-modifier 'meta
      mac-option-modifier 'super)

(when (equal system-type 'darwin)
  (setq trash-directory "~/.Trash"))

(setq user-emacs-directory "~/.emacs.d/cache/"
      backup-directory-alist `(("." . ,(expand-file-name "backups" user-emacs-directory)))
      abbrev-file-name (expand-file-name "abbrev_defs" user-emacs-directory)
      url-history-file (expand-file-name "url/history" user-emacs-directory)
      auto-save-list-file-prefix (expand-file-name "auto-save-list/.saves-" user-emacs-directory)
      auto-save-file-name-transforms `((".*" ,(expand-file-name "auto-save-list" user-emacs-directory) t))
      create-lockfiles nil
      projectile-known-projects-file (expand-file-name "projectile-bookmarks.eld" user-emacs-directory)
      custom-file (expand-file-name "lisp/custom.el" doom-user-dir))

(setq initial-scratch-message ";; This buffer is for text that is not saved, and for Lisp evaluation.\n;; To create a file, visit it with C-x C-f and enter text in its buffer.\n\n"
      initial-major-mode 'lisp-interaction-mode)

(map! :leader
      ;; Buffer
      "b c" nil
      "b C" nil
      "b n" nil
      "b N" nil
      "b p" nil
      "b s" nil
      "b S" nil
      "b u" nil
      ;; Code
      "c j" nil
      "c J" nil
      "c w" nil
      "c W" nil
      ;; File
      :desc "Copy file to" "f c" #'doom/copy-this-file
      "f C" nil
      :desc "Delete file" "f d" #'doom/delete-this-file
      "f D" nil
      "f e" nil
      "f E" nil
      "f F" nil
      "f p" nil
      "f P" nil
      ;; Magit
      "g D" nil
      ;; Help
      "h 4" nil
      "h <f1>" nil
      "h C-\\" nil
      "h C-a" nil
      "h C-c" nil
      "h C-d" nil
      "h C-e" nil
      "h C-f" nil
      "h C-k" nil
      "h C-l" nil
      "h C-n" nil
      "h C-o" nil
      "h C-p" nil
      "h C-s" nil
      "h C-t" nil
      "h C-w" nil
      "h <help>" nil
      ;; Insert
      "i p" nil
      "i r" nil
      ;; Open
      "o A" nil
      "o b" nil
      "o i" nil
      "o I" nil
      "o l" nil
      "o L" nil
      "o u" nil
      "o U" nil
      ;; Notes
      "n c" nil
      "n C" nil
      "n d" nil
      "n l" nil
      "n o" nil
      "n v" nil
      "n y" nil
      "n Y" nil
      ;; Quit
      "q F" nil
      "q Q" nil
      ;; Search
      :desc "Search all open buffers" "s b" #'swiper-all
      "s B" nil
      "s k" nil
      "s K" nil
      "s l" nil
      "s L" nil
      "s m" nil
      :desc "Search other project" "s p" #'+default/search-other-project
      "s P" nil
      "s t" nil
      "s T" nil
      ;; Toggle
      "t F" nil
      "t g" nil)
#+END_SRC

** Scripts
Place custom scripts under =~/.doom.d/lisp=
Set the listed secrets in =~/.doom.d/lisp/.secret.el=
#+BEGIN_SRC emacs-lisp
(defvar emax/elfeed-feeds nil)

(load! "lisp/.secret.el")
(add-load-path! "lisp/")
#+END_SRC


* User Interface
** Ivy and Counsel
#+BEGIN_SRC emacs-lisp
(after! ivy
  (setq ivy-extra-directories '("./"))

  (map! :desc "swiper"
        :g "C-s" #'counsel-grep-or-swiper)

  (map! :desc "swiper-isearch"
        :nv "/" #'swiper-isearch))

(after! counsel
  (setq counsel-find-file-ignore-regexp nil)
  (setq counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
  (setq counsel-grep-base-command "rg -i -M 120 --no-heading --line-number --color never %s %s")
  (setq counsel-mode-override-describe-bindings t)

  (map! :leader
        :desc "counsel-switch-buffer"
        "," #'counsel-switch-buffer
        "b b" #'counsel-switch-buffer
        "s s" #'counsel-rg)

  (map! :desc "counsel-switch-buffer"
        :g "C-x b" #'counsel-switch-buffer
        :g "C-x s" #'counsel-rg))

(defun emax/kill-buffer ()
  "Wraps kill-buffer."
  (interactive)
  (ivy-read "Kill buffer: " #'internal-complete-buffer
            :preselect (buffer-name)
            :action #'kill-buffer
            :matcher #'ivy--switch-buffer-matcher
            :caller 'ivy-switch-buffer))

(after! ivy-rich
  (setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line)

  (map! :leader
        :desc "Kill buffer"
        "b k" #'emax/kill-buffer)

  (map! :desc "Kill buffer"
        :g "C-x k" #'emax/kill-buffer))
#+END_SRC

** Lines
#+BEGIN_SRC emacs-lisp
(column-number-mode)
(setq display-line-numbers-type 'visual)

(add-hook 'text-mode-hook #'(lambda () (company-mode -1)))
(add-hook! '(text-mode-hook prog-mode-hook) #'display-line-numbers-mode #'yascroll-bar-mode)
(add-hook 'org-mode-hook #'(lambda ()
                                 (yascroll-bar-mode 1)
                                 (display-line-numbers-mode -1)
                                 (company-mode -1)))

;; Wrap lines
(global-visual-line-mode)
#+END_SRC

** Theme
#+BEGIN_SRC emacs-lisp
(defvar emax/light-theme 'doom-one-light)
(defvar emax/dark-theme 'doom-one)
(setq doom-theme emax/dark-theme)

(defun emax/set-theme (theme)
  (setq doom-theme theme)
  (load-theme theme t))

(defun emax/toggle-theme ()
  "Toggle between light and dark theme."
  (interactive)
  (if (string= doom-theme emax/dark-theme)
      (emax/set-theme emax/light-theme)
    (emax/set-theme emax/dark-theme)))

(setq doom-themes-enable-bold t
      doom-themes-enable-italic t)
#+END_SRC

** Modeline
#+BEGIN_SRC emacs-lisp
(after! doom-modeline
  (setq doom-modeline-buffer-encoding nil
        doom-modeline-workspace-name t)
  (add-hook! 'size-indication-mode-hook (setq size-indication-mode nil)))
#+END_SRC

** Scroll Bar
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! yascroll)
#+END_SRC

#+BEGIN_SRC emacs-lisp
(after! yascroll
  (global-yascroll-bar-mode 1)
  (setq yascroll:delay-to-hide nil
        yascroll:scroll-bar 'right-fringe))
#+END_SRC


* Keybindings
** Projectile
#+BEGIN_SRC emacs-lisp
(after! projectile
  (map! :leader
        "p ." nil
        "p C" nil
        "p D" nil
        :desc "Find file in other project" "p f" #'doom/find-file-in-other-project
        "p F" nil))
#+END_SRC

** Evil
#+BEGIN_SRC emacs-lisp
(after! evil
  (map! :leader
        "x" nil)
  (map! :m "j" #'evil-next-visual-line
        :m "k" #'evil-previous-visual-line
        :n "u" #'undo
        :n "q" nil ;; Disable 'q' for macro
        ;; 'g'
        :n "g ;" nil
        :m "g #" nil
        :m "g $" nil
        :n "g &" nil
        :m "g *" nil
        :n "g ," nil
        :n "g -" nil
        :m "g 0" nil
        :n "g =" nil
        :n "g 8" nil
        :n "g ?" nil
        :nv "g @" nil
        :m "g ^" nil
        :m "g _" nil
        :n "g A" nil
        :nv "g c" nil
        :m "g e" nil
        :m "g E" nil
        :n "g F" nil
        :nv "g i" #'+lookup/implementations
        :nv "g I" nil
        :m "g j" nil
        :n "g J" nil
        :m "g k" nil
        :nv "g l" nil
        :nv "g L" nil
        :m "g M" nil
        :m "g m" nil
        :m "g n" nil
        :m "g N" nil
        :m "g o" nil
        :nv "g o" #'counsel-imenu
        :nv "g O" nil
        :n "g p" nil
        :n "g q" #'+format:region
        :n "g Q" nil
        :m "g s" nil
        :n "g t" nil
        :n "g T" nil
        :nv "g u" nil
        :nv "g U" nil
        :m "g v" nil
        :n "g w" nil
        :nv "g x" nil
        :nv "g y" nil
        :nv "g z" nil
        :n "g ~" nil
        :m "g C-]" nil
        :m "g C-g" nil
        :m "g <down>" nil
        :m "g <end>" nil
        :m "g <home>" nil
        :m "g <up>" nil
        ;; 'z'
        :m "z RET" nil
        :m "z <return>" nil
        :m "z +" nil
        :m "z -" nil
        :m "z ." nil
        :mnv "z =" nil
        :m "z ^" nil
        :m "z b" nil
        :m "z F" nil
        :m "z j" nil
        :m "z k" nil
        :m "z t" nil
        :n "z x" nil
        :m "z z" nil
        :m "z <left>" nil
        :m "z <right>" nil
        ;; '[]'
        :nm "[ o" nil
        :nm "] o" nil
        :m "[ u" nil
        :m "] u" nil
        :m "[ x" nil
        :m "] x" nil
        :m "[ y" nil
        :m "] y" nil))

(after! evil-collection
  (setq evil-collection-setup-minibuffer t))
#+END_SRC

