emacs/.doom.d/config.el
(setq user-full-name "maxminoS")

;; Open new frames in current Emacs
(require 'server)
(if (not (server-running-p)) (server-start))

;; Reload file if edited
(global-auto-revert-mode t)

;; Enable narrowing
(put 'narrow-to-region 'disabled nil)

;; Set frame transparency (needs compositor)
(set-frame-parameter (selected-frame) 'alpha '(95 . 95))
(add-to-list 'default-frame-alist '(alpha . (95 . 95)))
(set-frame-parameter (selected-frame) 'fullscreen 'maximized)
(add-to-list 'default-frame-alist '(fullscreen . maximized))
(setq frame-resize-pixelwise t)

;; Set appropriate macOS key modifiers
(setq mac-command-modifier 'meta
      mac-option-modifier 'super)

(when (equal system-type 'darwin)
  (setq trash-directory "~/.Trash"))

(setq user-emacs-directory "~/.emacs.d/cache/"
      backup-directory-alist `(("." . ,(expand-file-name "backups" user-emacs-directory)))
      abbrev-file-name (expand-file-name "abbrev_defs" user-emacs-directory)
      url-history-file (expand-file-name "url/history" user-emacs-directory)
      auto-save-list-file-prefix (expand-file-name "auto-save-list/.saves-" user-emacs-directory)
      auto-save-file-name-transforms `((".*" ,(expand-file-name "auto-save-list" user-emacs-directory) t))
      create-lockfiles nil
      projectile-known-projects-file (expand-file-name "projectile-bookmarks.eld" user-emacs-directory)
      custom-file (expand-file-name "lisp/custom.el" doom-user-dir))

(setq initial-scratch-message ";; This buffer is for text that is not saved, and for Lisp evaluation.\n;; To create a file, visit it with C-x C-f and enter text in its buffer.\n\n"
      initial-major-mode 'lisp-interaction-mode)

(defvar emax/elfeed-feeds nil)

(load! "lisp/.secret.el")
(add-load-path! "lisp/")

(after! ivy
  (setq ivy-extra-directories '("./"))

  (map! :desc "swiper"
        :g "C-s" #'counsel-grep-or-swiper)

  (map! :desc "swiper-isearch"
        :nv "/" #'swiper-isearch))

(after! counsel
  (setq counsel-find-file-ignore-regexp nil)
  (setq counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
  (setq counsel-grep-base-command "rg -i -M 120 --no-heading --line-number --color never %s %s")
  (setq counsel-mode-override-describe-bindings t)

  (map! :leader
        :desc "counsel-switch-buffer"
        "," #'counsel-switch-buffer
        "b b" #'counsel-switch-buffer
        "s s" #'counsel-rg)

  (map! :desc "counsel-switch-buffer"
        :g "C-x b" #'counsel-switch-buffer
        :g "C-x s" #'counsel-rg))

(defun emax/kill-buffer ()
  "Wraps kill-buffer."
  (interactive)
  (ivy-read "Kill buffer: " #'internal-complete-buffer
            :preselect (buffer-name)
            :action #'kill-buffer
            :matcher #'ivy--switch-buffer-matcher
            :caller 'ivy-switch-buffer))

(after! ivy-rich
  (setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line)

  (map! :leader
        :desc "Kill buffer"
        "b k" #'emax/kill-buffer)

  (map! :desc "Kill buffer"
        :g "C-x k" #'emax/kill-buffer))

(column-number-mode)
(setq display-line-numbers-type 'visual)
(dolist (mode '(text-mode-hook
                prog-mode-hook
                conf-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 1))))

(dolist (mode '(org-mode-hook))
  (add-hook mode (lambda ()
                   (display-line-numbers-mode -1)
                   (company-mode -1))))

;; Wrap lines
(global-visual-line-mode)

(defvar emax/light-theme 'doom-one-light)
(defvar emax/dark-theme 'doom-one)
(setq doom-theme emax/dark-theme)

(defun emax/set-theme (theme)
  (setq doom-theme theme)
  (load-theme theme t))

(defun emax/toggle-theme ()
  "Toggle between light and dark theme."
  (interactive)
  (if (string= doom-theme emax/dark-theme)
      (emax/set-theme emax/light-theme)
    (emax/set-theme emax/dark-theme)))

(setq doom-themes-enable-bold t
      doom-themes-enable-italic t)

(after! doom-modeline
  (setq doom-modeline-buffer-encoding nil
        doom-modeline-workspace-name t)
  (add-hook! 'size-indication-mode-hook (setq size-indication-mode nil)))

(after! yascroll
  (global-yascroll-bar-mode 1)
  (setq yascroll:delay-to-hide nil
        yascroll:scroll-bar 'right-fringe))

(after! evil
  (map! :leader
        "x" nil)
  (map! :m "j" #'evil-next-visual-line
        :m "k" #'evil-previous-visual-line
        :n "u" #'undo
        :n "q" nil)) ;; Disable 'q' for macro

(after! evil-collection
  (setq evil-collection-setup-minibuffer t))

(map! :leader
      (:prefix ("<DEL>" . "goto")

       :desc "scratch"
