emacs/.doom.d/config.el
       "<DEL>" #'(lambda () (interactive) (find-file "~/Dropbox/org/scratch.org"))
       :desc "agenda-day"
       "d" #'(lambda () (interactive) (find-file "~/Dropbox/org/agenda/day.org"))
       :desc "agenda-month"
       "m" #'(lambda () (interactive) (find-file "~/Dropbox/org/agenda/month.org"))
       :desc "agenda-year"
       "y" #'(lambda () (interactive) (find-file "~/Dropbox/org/agenda/year.org"))

       :desc "review-film"
       "F" #'(lambda () (interactive) (find-file "~/Dropbox/org/reviews/film.org"))
       :desc "review-show"
       "S" #'(lambda () (interactive) (find-file "~/Dropbox/org/reviews/show.org"))
       :desc "review-music"
       "M" #'(lambda () (interactive) (find-file "~/Dropbox/org/reviews/music.org"))
       :desc "review-book"
       "B" #'(lambda () (interactive) (find-file "~/Dropbox/org/reviews/book.org"))

       :desc "notes"
       "g" #'(lambda () (interactive) (counsel-find-file "~/Dropbox/org/notes/"))
       :desc "notes-programming"
       "p" #'(lambda () (interactive) (counsel-find-file "~/Dropbox/org/notes/programming/"))
       :desc "notes-recreation"
       "r" #'(lambda () (interactive) (counsel-find-file "~/Dropbox/org/notes/recreation/"))
       :desc "notes-technology"
       "t" #'(lambda () (interactive) (counsel-find-file "~/Dropbox/org/notes/technology/"))

       :desc "bookmarks"
       "b" #'(lambda () (interactive) (find-file "~/Dropbox/org/notes/others/bookmarks.org"))
       :desc "essays"
       "e" #'(lambda () (interactive) (find-file "~/Dropbox/org/notes/others/essays.org"))
       :desc "ideas"
       "i" #'(lambda () (interactive) (find-file "~/Dropbox/org/notes/others/ideas.org"))
       :desc "lists"
       "l" #'(lambda () (interactive) (find-file "~/Dropbox/org/notes/others/lists.org"))))

(map! :leader
      (:prefix ("a" . "pass")

       :desc "Insert pass"
       "i" #'password-store-insert
       :desc "Insert OTP"
       "I" #'emax/password-store-otp-insert-code
       :desc "Generate pass"
       "g" #'password-store-generate

       :desc "Copy pass"
       "c" #'password-store-copy
       :desc "Copy field"
       "C" #'password-store-copy-field
       :desc "Copy OTP"
       "o" #'password-store-otp-token-copy

       :desc "Edit pass"
       "e" #'password-store-edit
       :desc "Rename pass"
       "r" #'password-store-rename
       :desc "Remove pass"
       "x" #'password-store-remove))

(after! dired
  (add-hook 'dired-mode-hook (lambda () (dired-hide-details-mode)))
  (setq dired-recursive-deletes 'always)

  (map! :leader :desc "Dired Jump" :n "d" #'dired-jump)
  (map! :desc "Dired Jump" :g "C-x d" #'dired-jump)

  (map! (:map dired-mode-map
         :n "N" #'mkdir
         :n "," #'dired-hide-details-mode
         :n "H" #'dired-hide-dotfiles-mode
         :n "h" #'dired-single-up-directory
         :n "l" #'dired-single-buffer
         :n "<tab>" #'dired-subtree-toggle
         :n "<backtab>" #'dired-subtree-cycle
         :n "p" #'peep-dired)))

(after! org
  ;; Replace dashes to bullet
  (font-lock-add-keywords 'org-mode
     '(("^ *\\([-]\\) " (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
  ;; Resize headlines
  (set-face-attribute 'org-level-1 nil :height 1.25)
  (set-face-attribute 'org-level-2 nil :height 1.15)
  (set-face-attribute 'org-level-3 nil :height 1.12)
  (set-face-attribute 'org-level-4 nil :height 1.1)
  (set-face-attribute 'org-level-5 nil :height 1.05)
  (set-face-attribute 'org-level-6 nil :height 1.05)

  (setq org-ellipsis " ▾"
        org-todo-keywords '((sequence "TODO(t)" "DOING(d)" "|" "DONE(x)")
                            (sequence "WAITING(w)" "|" "CANCELED(c)"))
        org-agenda-span 'week
        org-directory "~/Dropbox/org"
        org-default-notes-file "~/Dropbox/org/scratch.org"
        org-agenda-files '("~/Dropbox/org/agenda")
        org-refile-targets '(("~/Dropbox/org/archive.org" :maxlevel . 1))))

(after! org
  (setq org-capture-templates
          `(("c" "Scratch" item (file+headline ,(concat org-directory "/scratch.org") "Untracked")
                  "- %?")
            ("i" "Idea" entry (file ,(concat org-directory "/notes/others/ideas.org"))
                  "* %?" :empty-lines 1)

            ("t" "Task" entry (file+headline ,(concat org-directory "/agenda/tasks.org") "Task Manager")
                  "** TODO %?\n   SCHEDULED: %t" :kill-buffer t)
            ("d" "Deadline" entry (file+headline ,(concat org-directory "/agenda/tasks.org") "Task Manager")
                  "** TODO %?\n   DEADLINE: %^t" :kill-buffer t)

            ("e" "Essay" entry (file ,(concat org-directory "/notes/others/essays.org"))
                  "* %? %^g\n %u" :empty-lines 1 :jump-to-captured t)

            ("r" "Review")
            ("rf" "Film" entry (file ,(concat org-directory "/reviews/film.org"))
                  "* %^{Film Title} (%^{Year Released}) %^g\n%?" :empty-lines 1 :jump-to-captured t)
            ("ra" "Album" plain (file+function ,(concat org-directory "/reviews/music.org") (lambda () (emax/org-capture-existing-heading "Artist")))
                  "** %^{Album Title} %^g\n\n*** %? %^g" :jump-to-captured t)
            ("rb" "Book" entry (file ,(concat org-directory "/reviews/book.org"))
                  "* %^{Book Title} - %^{Author} %^g\n** Chapter 1\n** Review\n%?" :empty-lines 1 :jump-to-captured t)
            ("rs" "Show" entry (file ,(concat org-directory "/reviews/show.org"))
                  "* %^{Show Title} (YYYY)-(YYYY) %^g\n** Season 1\n** Review\n%?" :empty-lines 1 :jump-to-captured t)

            ("j" "Journal")
            ("jd" "Today" plain (file+olp+datetree ,(concat org-directory "/agenda/day.org"))
                  "%?" :tree-type month :kill-buffer t :unnarrowed t)
            ("jm" "This Month" plain (file+function ,(concat org-directory "/agenda/month.org") (lambda () (emax/org-datetree-find-date-create t)))
                  "" :kill-buffer t :unnarrowed t)
            ("jy" "This Year" plain (file+function ,(concat org-directory "/agenda/year.org") (lambda () (emax/org-datetree-find-date-create)))
                  "" :kill-buffer t :unnarrowed t)

            ("l" "Link")))

  (dolist (bookmarks '("Articles" "Blogs" "Entertainment"
                       "Resources" "Social" "Technology"
                       "Videos" "Others"))
       (add-to-list 'org-capture-templates
                   `(,(concat "l" (downcase (substring bookmarks 0 1))) ,bookmarks item (file+headline ,(concat org-directory "/notes/others/bookmarks.org") ,bookmarks)
                          "- [[https://%^{Link}][%^{Name}]]" :kill-buffer t) t)))

(after! forge
