emacs/.doom.d/config.org
** Magit
Set the appropriate usernames:
=git config --global github.user USERNAME=
=git config --global gitlab.user USERNAME=

Create Personal Access Tokens and store them as =/.emacs.d/lisp/.authinfo.gpg=

Requires: =git=
#+BEGIN_SRC emacs-lisp
(after! forge
  (add-to-list 'auth-sources `(,(expand-file-name "lisp/.authinfo.gpg" doom-user-dir))))
#+END_SRC

** Window Management
| C-w h/j/k/l | Switch window                 |
| C-w C-w     | Next window                   |
| C-w r       | Rotate windows                |
| C-w o       | Only this window              |
| C-w c       | Quit this window              |
| C-w s/v     | Split horizontally/vertically |
| C-w =       | Balance windows               |
| C-w +/-     | Increase/decrease height      |
| C-w >/<     | Increase/decrease width       |
| C-w <arrow> | Swap window to                |
#+BEGIN_SRC emacs-lisp
(after! windmove
  (map! :leader
        "w <left>" #'windmove-swap-states-left
        "w <down>" #'windmove-swap-states-down
        "w <up>" #'windmove-swap-states-up
        "w <right>" #'windmove-swap-states-right
        "w b" nil
        "w d" nil
        "w H" nil
        "w J" nil
        "w K" nil
        "w L" nil
        "w m" nil
        "w n" nil
        "w p" nil
        "w q" nil
        "w t" nil
        "w T" nil
        "w u" nil
        "w S" nil
        "w V" nil
        "w C-_" nil
        "w C-b" nil
        "w C-c" nil
        "w C-f" nil
        "w C-h" nil
        "w C-j" nil
        "w C-k" nil
        "w C-l" nil
        "w C-n" nil
        "w C-o" nil
        "w C-p" nil
        "w C-r" nil
        "w C-s" nil
        "w C-t" nil
        "w C-u" nil
        "w C-v" nil
        "w C-w" nil
        "w C-S-h" nil
        "w C-S-h" nil
        "w C-S-j" nil
        "w C-S-k" nil
        "w C-S-l" nil
        "w C-S-r" nil
        "w C-S-s" nil
        "w C-S-w" nil))
#+END_SRC

** Monocle
| C-w RET | Monocle |
#+BEGIN_SRC emacs-lisp
(defvar emax/monocle-windows nil)
(defun emax/toggle-monocle ()
  "Monocle window mode"
  (interactive)
  (if (one-window-p)
      (when emax/monocle-windows
        (set-window-configuration emax/monocle-windows))
    (setq emax/monocle-windows (current-window-configuration))
    (delete-other-windows)))

(map! :leader
      :desc "toggle-monocle"
      "w RET" #'emax/toggle-monocle)
#+END_SRC

** IBuffer
#+BEGIN_SRC emacs-lisp
(after! ibuffer
  (map! "C-x C-b" #'ibuffer
        (:map ibuffer-mode-map
         :n "j" #'ibuffer-forward-line
         :n "k" #'ibuffer-backward-line
         :n "h" #'evil-backward-WORD-begin
         :n "l" #'evil-forward-WORD-begin))


  (define-ibuffer-column size-h
    (:name "Size" :inline t)
    (file-size-human-readable (buffer-size)))

  (setq ibuffer-formats
        '((mark modified read-only locked " "
                (name 22 22 :left :elide) " "
                (size-h 9 -1 :right) " "
                (mode 12 12 :left :elide) " "
                filename-and-process)
          (mark " " (name 16 16) "   " (mode 8 8))))

  (setq ibuffer-filter-group-name-face 'font-lock-doc-face)


  (setq ibuffer-saved-filter-groups
        '(("Default"
           ("Agenda" (and
                      (filename . "agenda")
                      (filename . ".org")))
           ("Emacs" (or
                     (name . "^\\*scratch\\*$")
                     (name . "^\\*Messages\\*$")
                     (filename . ".emacs.d")))
           ("Document" (or
                        (mode . org-mode)
                        (mode . nov-mode)
                        (mode . doc-view-mode)))
           ("Compile" (or
                       (mode . eshell-mode)
                       (mode . shell-mode)
                       (mode . term-mode)))
           ("Dired" (mode . dired-mode))
           ("Magit" (name . "^magit"))
           ("Help" (or
                    (name . "^*\\(.*\\)*$")
                    (mode . help-mode)
                    (mode . helpful-mode)
                    (mode . Info-mode)
                    (mode . apropos-mode)
                    (mode . debugger-mode)
                    (mode . Man-mode))))))

  (add-hook 'ibuffer-mode-hook #'(lambda ()
                                   (ibuffer-auto-mode)
                                   (ibuffer-switch-to-saved-filter-groups "Default"))))
#+END_SRC

** VTerm
Requires: =cmake=, =libtool-bin=, =libvterm[-dev]=


* Development
** LSP Mode
| SPC c | LSP leader key |
#+BEGIN_SRC emacs-lisp
(setq lsp-use-plists t)
(after! lsp-mode
  (add-hook! 'lsp-mode-hook #'lsp-ui-mode #'lsp-headerline-breadcrumb-mode #'company-mode)

  (set-face-background 'lsp-face-highlight-textual "#1f1147")
  (setq lsp-before-save-edits nil
        lsp-enable-snippet nil
        lsp-restart 'auto-restart
        lsp-headerline-breadcrumb-enable t
        +format-with-lsp nil
        lsp-eslint-auto-fix-on-save t))

(after! lsp-ui
  (setq lsp-ui-doc-frame-parameters '((left . -3)
                                      (no-focus-on-map . t)
                                      (min-width . 15)
                                      (width . 0)
                                      (min-height . 0)
                                      (height . 0)
                                      (internal-border-width . 1)
                                      (vertical-scroll-bars . nil)
                                      (horizontal-scroll-bars . nil)
                                      (right-fringe . 0)
                                      (menu-bar-lines . 0)
                                      (tool-bar-lines . 0)
                                      (line-spacing . 0)
                                      (unsplittable . t)
                                      (undecorated . t)
                                      (top . -1)
                                      (visibility . nil)
                                      (mouse-wheel-frame . nil)
                                      (no-other-frame . t)
                                      (inhibit-double-buffering . t)
                                      (drag-internal-border . t)
                                      (no-special-glyphs . t)
                                      (alpha . (100 . 100))
                                      (desktop-dont-save . t)))

  ;; Make UI doc and peek more readable
  (set-face-background 'markdown-code-face "#1f1147")
                                        ;(set-face-foreground 'lsp-ui-peek-highlight "#cd00cd")
                                        ;(set-face-background 'lsp-ui-peek-filename "#cd00cd")
                                        ;(set-face-background 'lsp-ui-peek-selection "#8b008b")

  (setq lsp-ui-sideline-enable nil
        lsp-ui-doc-show-with-cursor t
        lsp-ui-doc-show-with-mouse nil
        lsp-ui-doc-delay 0.5))
#+END_SRC

** Autocompletion
#+BEGIN_SRC emacs-lisp
(after! company-mode
  (global-company-mode -1)
  (setq custom-idle-delay 0.0))
#+END_SRC

** Tabs
| M-S-i | Insert tab |
#+BEGIN_SRC emacs-lisp
(setq tab-always-indent t)

(map! :leader
      :desc "Tab"
      "i t" #'(lambda () (interactive) (insert "\t")))
#+END_SRC

** Code Folding
| z a | Toggle fold |
| z m | Close all   |
| z r | Open all    |

** Save Without Formatting
| SPC f s | save-without-formatting |
#+BEGIN_SRC emacs-lisp
(defun emax/save-without-formatting ()
  (interactive)
  (if (equal format-all-mode t)
    (progn (format-all-mode -1)
           (save-buffer)
           (format-all-mode 1))
    (save-buffer)))

(map! :leader
      :desc "Save without formatting"
      "f S" #'emax/save-without-formatting)
#+END_SRC

** Multiple Cursors
| M-d | Match next word under cursor      |
| M-D | Match previous word before cursor |

