emacs/.doom.d/config.org
** Pair Editing
| SPC z <pair>     | Wrap   |
| SPC z < / >      | Unwrap |
| SPC z left/right | Slurp  |
| SPC z h / l      | Barf   |
| SPC z z          | Swap   |
#+BEGIN_SRC emacs-lisp
(after! smartparens
  (show-paren-mode t)
  (smartparens-global-mode t)
  (add-hook! '(text-mode-hook prog-mode-hook) #'smartparens-mode)

  (defun emax/sp-wrap-with-char (char)
    "Wrap the following expression with CHAR. If region is active and `use-region-p' returns true, wrap the region."
    (when (use-region-p)
      (let* ((rb (region-beginning))
             (re (region-end)))
        (goto-char re)
        (insert char)
        (goto-char rb)
        (insert char))))

  (map! :leader
        (:map smartparens-mode-map
         (:prefix ("z" . "smartparens")
         ;; Wrap
         "(" #'sp-wrap-round  ; ")"
         "[" #'sp-wrap-square ; "]""
         "{" #'sp-wrap-curly ; "}"
         :desc "Wrap quotes"
         "\"" #'(lambda (&optional args) (interactive "P") (sp-wrap-with-pair "\""))
         :desc "Wrap *"
         "*" #'(lambda (&optional args) (interactive "P") (emax/sp-wrap-with-char "*"))
         :desc "Wrap /"
         "/" #'(lambda (&optional args) (interactive "P") (emax/sp-wrap-with-char "/"))
         :desc "Wrap _"
         "_" #'(lambda (&optional args) (interactive "P") (emax/sp-wrap-with-char "_"))
         :desc "Wrap ="
         "=" #'(lambda (&optional args) (interactive "P") (emax/sp-wrap-with-char "="))
         :desc "Wrap ~"
         "~" #'(lambda (&optional args) (interactive "P") (emax/sp-wrap-with-char "~"))
         ;; Unwrap
         "<" #'sp-backward-unwrap-sexp
         ">" #'sp-unwrap-sexp
         ;; Slurp / Barf
         "h" #'sp-backward-slurp-sexp
         "l" #'sp-forward-slurp-sexp
         "<left>" #'sp-forward-barf-sexp
         "<right>" #'sp-backward-barf-sexp
         ;; Swap
         "z" #'sp-transpose-sexp))))
#+END_SRC

** Comment
| M-; | Comment/Uncomment |
#+BEGIN_SRC emacs-lisp
(map! :g "M-;" #'comment-line)
#+END_SRC


* Applications
** Password Store
Import the appropriate GPG keys

=git clone https://github.com/maxminoS/.password-store= in the pass directory

Requires: =gpg=, =pass[word-store]=

#+BEGIN_SRC emacs-lisp
(after! password-store
  (setq password-store-password-length 16))

(after! password-store-otp
   (defun emax/password-store-otp-insert-code" (entry issuer email otp-code)
     Insert a new ENTRY with OTP-URI generated using the enterred ISSUER, EMAIL, and CODE."
     (interactive (list (password-store-otp-completing-read)
                        (read-string "Issuer: ")
                        (read-string "Email: ")
                        (read-passwd "Code: " t)))
     (password-store-otp-add-uri 'insert entry
                                 (concat "otpauth://totp/" issuer ":" email "?secret=" otp-code "&issuer=" issuer))))
#+END_SRC

** Elfeed
| s/c | Search / Clear  |
| +/- | Add/Remove tag  |
| y   | Copy URL        |
| g o | Open in browser |
| g r | Update          |

#+BEGIN_SRC emacs-lisp

(after! elfeed
  (setq elfeed-search-filter "@3-months-ago +unread ")
  (setq elfeed-db-directory (expand-file-name "elfeed" user-emacs-directory))
  (setq elfeed-feeds emax/elfeed-feeds)

  (map! (:map elfeed-search-mode-map
         :n "g r" #'elfeed-update)))
#+END_SRC

** World Time Clock
#+BEGIN_SRC emacs-lisp
(setq display-time-world-list
  '(("" "*AMERICA*")
    ("America/Los_Angeles" "Los Angeles (PT)")
    ("America/New_York" "New York (ET)")
    ("America/Chicago" "Chicago (CT)")
    ("" "")
    ("" "*EUROPE*")
    ("Europe/London" "London (GMT)")
    ("Europe/Berlin" "Germany (GMT+1)")
    ("Europe/Athens" "Greece (GMT+3)")
    ("" "")
    ("" "*ASIA*")
    ("Asia/Jakarta" "Jakarta (GMT+7)")
    ("Asia/Singapore" "Singapore (GMT+8)")))

(setq display-time-world-time-format "- %I:%M%p - %a, %d %b")
#+END_SRC

** TLDR
#+BEGIN_SRC emacs-lisp :tangle packages.el
(package! tldr)
#+END_SRC
