emacs/.doom.d/config.el

(after! smartparens
  (show-paren-mode t)
  (smartparens-global-mode t)
  (dolist (mode '(text-mode-hook
                  prog-mode-hook))
    (add-hook! mode (lambda () (smartparens-mode))))

  (map! :leader
        (:map smartparens-mode-map
         (:prefix ("z" . "smartparens")
         ;; Wrap
          "(" #'sp-wrap-round  ; ")"
         "[" #'sp-wrap-square ; "]""
         "{" #'sp-wrap-curly ; "}"
         :desc "Wrap quotes"
         "\"" #'(lambda (&optional args) (interactive "P") (sp-wrap-with-pair "\""))
         :desc "Wrap *"
         "*" #'(lambda (&optional args) (interactive "P") (sp-wrap-with-pair "*"))
         :desc "Wrap /"
         "/" #'(lambda (&optional args) (interactive "P") (sp-wrap-with-pair "/"))
         :desc "Wrap _"
         "_" #'(lambda (&optional args) (interactive "P") (sp-wrap-with-pair "_"))
         :desc "Wrap ="
         "=" #'(lambda (&optional args) (interactive "P") (sp-wrap-with-pair "="))
         :desc "Wrap ~"
         "~" #'(lambda (&optional args) (interactive "P") (sp-wrap-with-pair "~"))
         ;; Unwrap
         "<" #'sp-backward-unwrap-sexp
         ">" #'sp-unwrap-sexp
         ;; Slurp / Barf
         "h" #'sp-backward-slurp-sexp
         "l" #'sp-forward-slurp-sexp
         "<left>" #'sp-forward-barf-sexp
         "<right>" #'sp-backward-barf-sexp
         ;; Swap
         "z" #'sp-transpose-sexp))))

(map! :g "M-;" #'comment-line)

(after! password-store
  (setq password-store-password-length 16))

(after! password-store-otp
   (defun emax/password-store-otp-insert-code" (entry issuer email otp-code)
     Insert a new ENTRY with OTP-URI generated using the enterred ISSUER, EMAIL, and CODE."
     (interactive (list (password-store-otp-completing-read)
                        (read-string "Issuer: ")
                        (read-string "Email: ")
                        (read-passwd "Code: " t)))
     (password-store-otp-add-uri 'insert entry
                                 (concat "otpauth://totp/" issuer ":" email "?secret=" otp-code "&issuer=" issuer))))

(after! elfeed
  (setq elfeed-search-filter "@3-months-ago +unread ")
  (setq elfeed-db-directory (expand-file-name "elfeed" user-emacs-directory))
  (setq elfeed-feeds emax/elfeed-feeds)

  (map! (:map elfeed-search-mode-map
         :n "g r" #'elfeed-update)))

(setq display-time-world-list
  '(("" "*AMERICA*")
    ("America/Los_Angeles" "Los Angeles (PT)")
    ("America/New_York" "New York (ET)")
    ("America/Chicago" "Chicago (CT)")
    ("" "")
    ("" "*EUROPE*")
    ("Europe/London" "London (GMT)")
    ("Europe/Berlin" "Germany (GMT+1)")
    ("Europe/Athens" "Greece (GMT+3)")
    ("" "")
    ("" "*ASIA*")
    ("Asia/Jakarta" "Jakarta (GMT+7)")
    ("Asia/Singapore" "Singapore (GMT+8)")))

(setq display-time-world-time-format "- %I:%M%p - %a, %d %b")
